app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def index
  	if user_signed_in?
  		@post= current_user.posts.build
  		@posts= current_user.posts

  	else
  		@posts=Post.all