app/controllers/posts_controller.rb

  def create
  	@post = current_user.posts.build(post_params)
  	if @post.save
---
INSERT INTO "posts" ("title", "text", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)